касса_Вегас/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <attributes>
    <name>АдресEmailПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЧекаЕГАИС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>0 - продажа, 1 - возврат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКоррекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеприменениеККТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПредписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКоррекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьЧекаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдресаМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакСпособаРасчета</name>
    <type>
      <types>EnumRef.ПризнакиСпособаРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложенияККТ</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплатыЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусыЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКоррекции</name>
    <type>
      <types>EnumRef.ТипыКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекОснование</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПродажи</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЧекКоррекции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаАкцизнойМарки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьШтрихкодаПриПродаже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСУчетомСкидки</name>
      <comment>Заполняется только при возврате товаров. Идентифицирует позицию чека продажи.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлобальныйИдентификаторТорговойЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлатежнойСистемы</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСсылкиОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлипЧек</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

касса_Вегас/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияДС</name>
    <type>
      <types>EnumRef.ВидыДвиженияДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

касса_Вегас/src/Enums/СтатусыЧеков/СтатусыЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЧеков</name>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Пробит</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СтатусыОплатыЧека/СтатусыОплатыЧека.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОплатыЧека</name>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ОплаченЧастично</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Documents/Чек/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Проведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.Чек.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	Проведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Продажи.ОтразитьДвижениеНаличных(ДополнительныеСвойства, Движения, Отказ);
	Продажи.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();
	Проведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	Проведение.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	Проведение.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	Если НЕ Отказ Тогда
		
		Если СтатусЧека = Перечисления.СтатусыЧеков.Пробит Тогда
			Продажи.АннулироватьСвязанныеНеПробитыеЧеки(Ссылка);
			РасчитатьСтатусРасчетовПоЗаказу();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЧекОснование = Неопределено;
	ЗаполнитьТоварыПоЧекуОснованию = Ложь;
	ЗаполнитьОплатыПоЧекуОснованию = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ЗаказКлиента) Тогда
			ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ЧекПродажи) Тогда
			ЧекПродажи = ДанныеЗаполнения.ЧекПродажи;
		КонецЕсли;
		
		Если ДанныеЗаполнения.ЭтоВозврат Тогда
			ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат();
		КонецЕсли;
		
		Если ДанныеЗаполнения.ЦенаВключаетНДС = Неопределено Тогда
			ЦенаВключаетНДС = ЗначениеНастроекПовтИсп.ЦенаВключаетНДС();
		Иначе
			ЦенаВключаетНДС = ДанныеЗаполнения.ЦенаВключаетНДС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ПризнакСпособаРасчета) Тогда
			ПризнакСпособаРасчета = ДанныеЗаполнения.ПризнакСпособаРасчета;
		КонецЕсли;
		
		Если ДанныеЗаполнения.ЭтоПолныйВозврат Тогда
			ЗаполнитьТоварыПриВозврате(ЧекПродажи);
		КонецЕсли;
		
		Если ДанныеЗаполнения.ЭтоЧекКоррекции Тогда
			ЭтоЧекКоррекции = Истина;
		КонецЕсли;
		
		Если ДанныеЗаполнения.НеприменениеККТ Тогда
			НеприменениеККТ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ДатаКоррекции) Тогда
			ДатаКоррекции = ДанныеЗаполнения.ДатаКоррекции;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ОписаниеКоррекции) Тогда
			ОписаниеКоррекции = ДанныеЗаполнения.ОписаниеКоррекции;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.НомерПредписания) Тогда
			НомерПредписания = ДанныеЗаполнения.НомерПредписания;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.НомерПредписания) Тогда
			НомерПредписания = ДанныеЗаполнения.НомерПредписания;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ЧекОснование) Тогда
			ЧекОснование = ДанныеЗаполнения.ЧекОснование;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ТипКоррекции) Тогда
			ТипКоррекции = ДанныеЗаполнения.ТипКоррекции;
		КонецЕсли;
		
		ЗаполнитьТоварыПоЧекуОснованию = ДанныеЗаполнения.ЗаполнитьТоварыПоЧекуОснованию;
		ЗаполнитьОплатыПоЧекуОснованию = ДанныеЗаполнения.ЗаполнитьОплатыПоЧекуОснованию;
		
	Иначе
		ЦенаВключаетНДС = ЗначениеНастроекПовтИсп.ЦенаВключаетНДС();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказКлиента)
		И НЕ ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ЗаполнитьЧекПоЗаказу(ЗаказКлиента);
		
	ИначеЕсли ЗначениеЗаполнено(ЧекОснование) Тогда
		
		ЗаполнитьЧекПоЧеку(ЧекОснование,
			ЗаполнитьТоварыПоЧекуОснованию, ЗаполнитьОплатыПоЧекуОснованию
		);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		
		РеквизитыЗаказа = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(ЗаказКлиента,
			"АдресДоставкиГород, АдресДоставкиУлица, АдресДоставкиДом, АдресДоставкиКвартира"
		);
		
		АдресРасчета = ГеолокацияКлиентСервер.ПолучитьПредставлениеАдреса(РеквизитыЗаказа.АдресДоставкиГород,
			РеквизитыЗаказа.АдресДоставкиУлица, РеквизитыЗаказа.АдресДоставкиДом, РеквизитыЗаказа.АдресДоставкиКвартира
		);
		
	КонецЕсли;
	
	РассчитатьСуммыДокумента();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтатусЧека) Тогда
		СтатусЧека = Перечисления.СтатусыЧеков.Отложен;
	КонецЕсли;
	
	Если СтатусЧека = Перечисления.СтатусыЧеков.Отложен И НЕ Оплаты.Количество() = 0 Тогда
		
		Если СуммаДокумента = Оплаты.Итог("Сумма") Тогда
			СтатусОплаты = Перечисления.СтатусыОплатыЧека.Оплачен;
		Иначе
			СтатусОплаты = Перечисления.СтатусыОплатыЧека.ОплаченЧастично;
		КонецЕсли;
		
	Иначе
		СтатусОплаты = Перечисления.СтатусыОплатыЧека.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЧекПоЗаказу(Заказ)
	
	Если ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита Тогда
		
		ЧекПередачиТоваров = ПродажиВызовСервера.ПолучитьЧекПередачиТоваровПоЗаказу(Заказ);
		ЗаполнитьТоварыПриВозврате(ЧекПередачиТоваров);
		
		Для Каждого СтрокаЧека Из Товары Цикл
			
			СтрокаЧека.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			СтрокаЧека.СуммаНДС  = 0;
			
		КонецЦикла;
		
	Иначе
		
		ЗаказКлиента = Заказ;
		
		РеквизитыЗаказа = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(Заказ,
			"ЦенаВключаетНДС"
		);
		
		ЦенаВключаетНДС = РеквизитыЗаказа.ЦенаВключаетНДС;
		
		Если ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.Аванс Тогда
			Возврат;
		КонецЕсли;
		
		ТоварыДляЗаполнения = Неопределено;
		
		Если ЗначениеНастроекПовтИсп.ИспользуютсяРасчетыСКлиентами() Тогда
			
			ЧекПередачиТоваров = ПродажиВызовСервера.ПолучитьЧекПередачиТоваровПоЗаказу(Заказ);
			
			Если ЗначениеЗаполнено(ЧекПередачиТоваров) Тогда
				ТоварыДляЗаполнения = ЧекПередачиТоваров.Товары;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТоварыДляЗаполнения = Неопределено Тогда
			ТоварыДляЗаполнения = Заказ.Товары;
		КонецЕсли;
		
		Для Каждого СтрокаТовары Из ТоварыДляЗаполнения Цикл
			
			СтрокаЧека = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЧека, СтрокаТовары,
				"Номенклатура, Количество, СкидкаНаценкаПроцент, СкидкаНаценкаСумма,
				|СуммаНДС, СтавкаНДС, Сумма, Цена"
			);
			
			СтрокаЧека.СтавкаНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавку_18_20(СтрокаЧека.СтавкаНДС);
			
			Если НЕ ЦенаВключаетНДС Тогда
				СтрокаЧека.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
			
			СтрокаЧека.НеобходимостьВводаАкцизнойМарки =
				ПродажиВызовСервера.ОпределитьНеобходимостьВводаАкцизнойМарки(СтрокаЧека.Номенклатура);
			
			СтрокаЧека.НеобходимостьШтрихкодаПриПродаже =
				ПродажиВызовСервера.ОпределитьНеобходимостьШтрихкодаПриПродаже(СтрокаЧека.Номенклатура);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчитатьСтатусРасчетовПоЗаказу()
	
	Если ЗначениеЗаполнено(ЗаказКлиента) И СтатусЧека = Перечисления.СтатусыЧеков.Пробит Тогда
		
		Продажи.РасчитатьСтатусРасчетовПоЗаказу(ЗаказКлиента);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммыДокумента()
	
	СуммаДокумента = Товары.Итог("Сумма");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Движения.ДенежныеСредства);
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ЗаполнитьТоварыПриВозврате(ЧекПередачиТоваров)
	
	ТаблицаТоваровДляВозврата = Продажи.ПолучитьТаблицуТоваровЧекаВозврата(ЧекПередачиТоваров);
	
	Если ТаблицаТоваровДляВозврата.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет товаров к возврату'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыВозврата Из ТаблицаТоваровДляВозврата Цикл
		
		СтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТаблицыВозврата);
		
		Если НЕ СтрокаТаблицыВозврата.Марки = Неопределено Тогда
			
			Для Каждого Марка Из СтрокаТаблицыВозврата.Марки Цикл
				НоваяМарка = Марки.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяМарка, Марка,
					"КлючСвязи, КодМаркировки, ТипМаркировки, ГлобальныйИдентификаторТорговойЕдиницы, СерийныйНомер");
			КонецЦикла;
			
			Если СтрокаТаблицыВозврата.Марки.Количество() = 0 Тогда
				СтрокаТовары.Количество = 0;
				СтрокаТовары.Сумма = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		СуммаНДС = 0;
		
		Если ЦенаВключаетНДС Тогда
			
			ПроцентНДС = ЦенообразованиеКлиентСерверПовтИсп.ПолучитьСтавкуНДСЧислом(СтрокаТовары.СтавкаНДС);
			
			Если ЗначениеЗаполнено(СтрокаТаблицыВозврата.ТипМаркировки) И СтрокаТовары.Количество > 1 Тогда
				
				Коэффициенты = Новый Массив(СтрокаТовары.Количество);
				
				Индекс = 0;
				Для Каждого _ Из Коэффициенты Цикл
					Коэффициенты[Индекс] = 1;
					Индекс = Индекс + 1;
				КонецЦикла;
				
				РаспределенныеСуммы = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаТовары.Сумма, Коэффициенты
				);
				
				Для Каждого РаспределеннаяСумма Из РаспределенныеСуммы Цикл
					СуммаНДС = СуммаНДС + ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(РаспределеннаяСумма, ПроцентНДС);
				КонецЦикла;
				
			Иначе
				СуммаНДС   = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТовары.Сумма, ПроцентНДС);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТовары.СуммаНДС  = СуммаНДС;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЧекПоЧеку(СсылкаНаЧек, ЗаполнитьТоварыПоЧекуОснованию, ЗаполнитьОплатыПоЧекуОснованию)
	
	Если НЕ ЗаполнитьТоварыПоЧекуОснованию И НЕ ЗаполнитьОплатыПоЧекуОснованию Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекТовары.Количество КАК Количество,
		|	ЧекТовары.Номенклатура КАК Номенклатура,
		|	ЧекТовары.СкидкаНаценкаПроцент КАК СкидкаНаценкаПроцент,
		|	ЧекТовары.СкидкаНаценкаСумма КАК СкидкаНаценкаСумма,
		|	ЧекТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЧекТовары.Сумма КАК Сумма,
		|	ЧекТовары.СуммаНДС КАК СуммаНДС,
		|	ЧекТовары.УдалитьСуммаСНДС КАК УдалитьСуммаСНДС,
		|	ЧекТовары.Цена КАК Цена,
		|	ЧекТовары.Штрихкод КАК Штрихкод,
		|	ЧекТовары.ЦенаСУчетомСкидки КАК ЦенаСУчетомСкидки
		|ИЗ
		|	Документ.Чек.Товары КАК ЧекТовары
		|ГДЕ
		|	ЧекТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекОплаты.Ссылка КАК Ссылка,
		|	ЧекОплаты.НомерСтроки КАК НомерСтроки,
		|	ЧекОплаты.ВидОплаты КАК ВидОплаты,
		|	ЧекОплаты.Сумма КАК Сумма,
		|	ЧекОплаты.ТипОплаты КАК ТипОплаты,
		|	ЧекОплаты.КлючСвязи КАК КлючСвязи
		|ИЗ
		|	Документ.Чек.Оплаты КАК ЧекОплаты
		|ГДЕ
		|	ЧекОплаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЧек);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если ЗаполнитьТоварыПоЧекуОснованию Тогда
		
		Выборка = РезультатЗапроса[0].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаЧека = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЧека, Выборка);
			
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаполнитьОплатыПоЧекуОснованию Тогда
		
		Выборка = РезультатЗапроса[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаЧека = Оплаты.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЧека, Выборка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
